app/controllers/api_controller.rb

	def receiveEvents
		map = JSON.parse(params[:data])
		if map['secret'] != SECRET
			logger.warn "Got post with bad secret: #{SECRET}"
			return ""
		end

		map['probing'].each do |c|
			e = Event.parse_event(c)
			if e.save
---
INSERT INTO `events` (`ap_mac`, `created_at`, `updated_at`, `rssi`, `rssi_db`, `last_seen`, `is_associated`, `client_mac`) VALUES('00:18:0a:e4:ac:f0', '2014-09-12 21:36:44', '2014-09-12 21:36:44', 13, -82, '2014-09-12 20:07:10', 0, '5a:59:48:da:42:5a')
UPDATE `events` SET `updated_at` = '2014-09-12 21:29:26', `is_associated` = 1 WHERE `id` = 3