app/controllers/events_controller.rb

  def index
    @events = Event.paginate(:page => params[:page], :per_page => 20)
---
SELECT * FROM `events` LIMIT 0, 5
SELECT count(*) AS count_all FROM `events`

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)